---

C#Visual BasicVisual C++

Revit 2024 API
---
ViewSheetSet..::..SheetOrganizationId Property
ViewSheetSet Class See Also Send Feedback
---

ElementId to the BrowserOrganization for sheets.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)

# Syntax

C#
---

    public virtual ElementId SheetOrganizationId { get; set; }

Visual Basic
---

    Public Overridable Property SheetOrganizationId As ElementId
    	Get
    	Set

Visual C++
---

    public:
    virtual property ElementId^ SheetOrganizationId {
    	ElementId^ get ();
    	void set (ElementId^ value);
    }

#### Implements

IViewSheetSet..::..SheetOrganizationId

# Remarks

Ignored when [!:Autodesk::Revit::DB::PrintSetup::IsAutomatic] is falseFalsefalsefalse (False in Visual Basic).

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when the ElementId does not reference to BrowserOrganization, or the target type of BrowserOrganization is incompatible. |

# See Also

ViewSheetSet Class

Autodesk.Revit.DB Namespace